---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem.Dispose
source: html/f8904fba-6518-b346-51c3-03be73bbaac7.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem.Dispose Method

Releases all resources used by the PipeFittingAndAccessoryPressureDropItem

## Syntax (C#)
```csharp
public void Dispose()
```